xml2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns="http://www.europaeische.at/2009/04">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:V4InsuranceContractRQ>
            <ns:providerNumber>{{EURO_providerNumber}}</ns:providerNumber>
            <ns:integratorNumber>{{EURO_integratorNumber}}</ns:integratorNumber>
            <ns:agencyNumber>{{EURO_agencyNumber}}</ns:agencyNumber>
            <ns:token>761-31744</ns:token>
            <ns:testMode>true</ns:testMode>
            <ns:externalReferenceNumber>12-34-56-78</ns:externalReferenceNumber>
            <ns:insuranceHolder>
                <ns:salutationCode>1</ns:salutationCode>
                <ns:title>Dr</ns:title>
                <ns:firstName>No</ns:firstName>
                <ns:lastName>Test</ns:lastName>
                <ns:street>Sesam</ns:street>
                <ns:zipCode>20537</ns:zipCode>
                <ns:city>Hamburg</ns:city>
                <ns:countryCode>DE</ns:countryCode>
                <ns:mobile>+49170111</ns:mobile>
                <ns:email>sven.lindow@bosys.info</ns:email>
            </ns:insuranceHolder>
            <ns:insuredPerson>
                <ns:title>Dr</ns:title>
                <ns:firstName>No</ns:firstName>
                <ns:lastName>Limits</ns:lastName>
                <ns:dayOfBirth>1990-02-02</ns:dayOfBirth>
                <ns:index>1</ns:index>
            </ns:insuredPerson>
            <ns:additionalContractData>
                <ns:shortData>
                    <ns:tripStartDate>2021-02-01</ns:tripStartDate>
                </ns:shortData>
            </ns:additionalContractData>
            <ns:preContractEmailReceiver>
                <ns:emailReceiver>sven.lindow@bosys.info</ns:emailReceiver>
            </ns:preContractEmailReceiver>
        </ns:V4InsuranceContractRQ>
    </soapenv:Body>
</soapenv:Envelope>